In [1]:
import pandas as pd

### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [23]:
data_movie = pd.read_csv(r'C:\Users\aekom\Lessons\11 Pandas\ml-25m\movies.csv')
data_rating = pd.read_csv(r'C:\Users\aekom\Lessons\11 Pandas\ml-25m\ratings.csv')

In [24]:
data_movie.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [25]:
data_rating.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [66]:
data_rating['movieId'].value_counts().head()

356     81491
318     81482
296     79672
593     74127
2571    72674
Name: movieId, dtype: int64

In [72]:
data_movie[data_movie['movieId'].isin(['356', '318', '296', '593', '2571'])]

      movieId                             title                       genres
292       296               Pulp Fiction (1994)  Comedy|Crime|Drama|Thriller
314       318  Shawshank Redemption, The (1994)                  Crime|Drama
351       356               Forrest Gump (1994)     Comedy|Drama|Romance|War
585       593  Silence of the Lambs, The (1991)        Crime|Horror|Thriller
2480     2571                Matrix, The (1999)       Action|Sci-Fi|Thriller

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [68]:
dataset = pd.read_csv('power.csv')

In [69]:
dataset.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [87]:
dataset[ dataset['country'].str.contains(r'(Latvia)|(Estonia)|(Lit)', case=False) ]['country'].unique()

array(['Lithuania', 'Latvia', 'Estonia'], dtype=object)

In [144]:
filtered_countries = dataset[ 
    ( (dataset['country']=='Latvia') | (dataset['country']=='Lithuania') | (dataset['country']=='Lithuania') ) & 
    ( (dataset['category']==4) | (dataset['category']==12) | (dataset['category']==21) ) &
    ( (dataset['year'] >= 2005) & (dataset['year'] <= 2010)  ) &
    ( (dataset['quantity'] >= 0) )
]
print(filtered_countries)
print ('Сумма по quanity равна: ', filtered_countries['quantity'].sum(), 
       '\nВся сумма по "quantity" равна: ', dataset['quantity'].sum())

          country  year  quantity  category
11156   Lithuania  2008       1.0         4
11157   Lithuania  2007       0.0         4
11158   Lithuania  2006       1.0         4
11159   Lithuania  2005       1.0         4
13294   Lithuania  2008       1.0         4
...           ...   ...       ...       ...
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

[309 rows x 4 columns]
Сумма по quanity равна:  177140.0
Вся сумма по "quantity" равна:  219179627208.76712

### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [139]:
my_tables = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='UTF-8')
print(my_tables)

[     0       1      2        3      4      5        6      7      8        9   \
0  ММВБ   2 709  -0,3%   Nasdaq  9 325   0,4%  Биткойн  9 301   1,4%  USD/RUB
1   РТС   1 188  -1,5%   S&P500  2 955   0,2%    Нефть    351  -2,3%  EUR/RUB
2   Dow  24 465   0,0%  FTSE100  5 993  -0,4%   Золото  1 737   0,0%  EUR/USD

       10     11
0  715745   0,9%
1  780390   0,3%
2   10898  -0,5%  ,     Unnamed: 0              Рубль  Предложение  Спрос  Предыдущее закрытие  \
0          NaN            GBP/RUB       871277      -               871974
1          NaN            EUR/RUB       780390      -               777675
2          NaN            USD/RUB       715745      -               709500
3          NaN            JPY/RUB        06649      -                06654
4          NaN            CNY/RUB       100380      -               100460
5          NaN            CHF/RUB       736970      -               737560
6          NaN               Евро  Предложение  Спрос  Предыдущее закрытие
7          NaN            EUR/USD        10898      -                10949
8          NaN            EUR/GBP        08953      -                08957
9          NaN            EUR/JPY      1173700      -              1178400
10         NaN            EUR/CHF        10591      -                10628
11         NaN         Доллар США  Предложение  Спрос  Предыдущее закрытие
12         NaN            USD/EUR        09176      -                09176
13         NaN            USD/GBP        08215      -                08215
14         NaN            USD/JPY      1076450      -              1076450
15         NaN            USD/CHF        09712      -                09708
16         NaN      Японская иена  Предложение  Спрос  Предыдущее закрытие
17         NaN    JPY/EUR (100:1)        08500      -                08500
18         NaN            JPY/GBP        00076      -                00076
19         NaN            JPY/USD        00093      -                00093
20         NaN    JPY/CHF (100:1)        09000      -                09000
21         NaN    Фунт стерлингов  Предложение  Спрос  Предыдущее закрытие
22         NaN            GBP/USD        12173      -                12223
23         NaN            GBP/JPY      1310363      -              1310424
24         NaN            GBP/EUR        11170      -                11166
25         NaN            GBP/CHF        11821      -                11866
26         NaN  Швейцарский франк  Предложение  Спрос  Предыдущее закрытие
27         NaN            GBP/CHF        11821      -                11866
28         NaN            EUR/CHF        10591      -                10628
29         NaN    JPY/CHF (100:1)        09000      -                09000
30         NaN            USD/CHF        09712      -                09708
31         NaN  Украинская гривна  Предложение  Спрос  Предыдущее закрытие
32         NaN            EUR/UAH       291675      -               291675
33         NaN            USD/UAH       267653      -               267653
34         NaN            CHF/UAH       275591      -               275591
35         NaN            GBP/UAH       325814      -               325814

          %  Абсолютное значение     Время
0   -0,08 %               -00697  06:35:00
1    0,35 %                02715  00:41:00
2    0,88 %                06245  00:00:00
3   -0,08 %               -00005  06:35:00
4   -0,08 %               -00080  06:35:00
5   -0,08 %               -00590  06:35:00
6         %  Абсолютное значение     Время
7   -0,47 %               -00051  00:23:00
8   -0,04 %               -00004  00:23:00
9   -0,40 %               -04700  00:54:00
10  -0,35 %               -00037  00:07:00
11        %  Абсолютное значение     Время
12   0,00 %                00000  06:35:00
13   0,00 %                00000  06:35:00
14   0,00 %                00000  00:23:00
15   0,04 %                00004  00:52:00
16        %  Абсолютное значение     Время
17   0,00 %                00000  06:35:00
18   0,00 %                00000  06:35:00
19   0,00 %                00000  06:35:00
20   0,04 %                00000  00:53:00
21        %  Абсолютное значение     Время
22  -0,41 %               -00050  00:09:00
23   0,00 %               -00061  06:35:00
24   0,04 %                00004  00:23:00
25  -0,38 %               -00045  00:09:00
26        %  Абсолютное значение     Время
27  -0,38 %               -00045  00:09:00
28  -0,35 %               -00037  00:07:00
29   0,04 %                00000  00:53:00
30   0,04 %                00004  00:52:00
31        %  Абсолютное значение     Время
32   0,00 %                00000  06:35:00
33   0,00 %                00000  06:35:00
34   0,00 %                00000  06:35:00
35   0,00 %                00000  06:35:00  ,                                                    0  \
0                                      Имя и фамилия
1                                            Телефон
2                                                NaN
3  Я даю согласие на обработку своих персональных...

                                                   1  \
0                                              Город
1                                              Email
2                                                NaN
3  Я даю согласие на обработку своих персональных...

                                                   2  \
0                                                NaN
1                                                NaN
2  Спасибо! Ваша заявка отправлена Финансовый кон...
3                                                NaN

                                                   3  \
0                                                NaN
1                                                NaN
2  Спасибо! Ваша заявка отправлена Финансовый кон...
3                                                NaN

                                                   4  \
0                                                NaN
1                                                NaN
2  ошибка: не удалось создать заявку в журнале за...
3                                                NaN

                                                   5                       6  \
0                                                NaN                     NaN
1                                                NaN                     NaN
2  ошибка: не удалось создать заявку в журнале за...  ошибка: не POST-запрос
3                                                NaN                     NaN

                        7                                                  8  \
0                     NaN                                                NaN
1                     NaN                                                NaN
2  ошибка: не POST-запрос  Просим Вас согласиться на передачу и обработку...
3                     NaN                                                NaN

                                                   9
0                                                NaN
1                                                NaN
2  Просим Вас согласиться на передачу и обработку...
3                                                NaN  ]